app/controllers/api/v1/professors_controller.rb

  def search
    @professors = Professor.search(params[:q])
---
SELECT "professors".* FROM "professors"