app/controllers/api/v1/search_controller.rb

SELECT "professors".* FROM "professors" WHERE "professors"."id" = $1 LIMIT 1  [["id", 1]]
---
  def search
    if params[:p].nil?
      professors = []
    elsif params[:p].include?(',')
      professors = params[:p].split(',')
    else
      professors = [params[:p]]
    end
    professors.collect! {|p_id| Professor.find(p_id)}